{
  "HomePage": {
    "Welcome on LexiLearn": "Bienvenue sur LexiLearn",
    "Ready to transform your language learning? Join LexiLearn today and master the vocabulary that will make all the difference!": "Prêt à transformer votre apprentissage des langues ? Rejoignez LexiLearn aujourd'hui et maîtrisez le vocabulaire qui fera la différence !",
    "Whether you're a student, professional or language enthusiast, LexiLearn helps you build a solid, relevant vocabulary in the languages of your choice More than just an application, it's your intelligent revision companion": "Que vous soyez étudiant, professionnel ou passionné de langues, LexiLearn vous aide à construire un vocabulaire solide et pertinent dans les langues de votre choix. Plus qu'une simple application, c'est votre compagnon de révision intelligent.",
    "Learn, enrich, master Your multilingual vocabulary at your fingertips" : "Apprendre, enrichir, maîtriser votre vocabulaire multilingue à la main",
    "Create your own word lists in several languages, adapted to your objectives and level of proficiency" : "Créez vos propres listes de mots dans plusieurs langues, adaptées à vos objectifs et à votre niveau.",
    "Test and reinforce your knowledge with a variety of fun exercises designed to make learning stimulating" : "Testez et renforcez vos connaissances avec des exercices variés et ludiques, conçus pour rendre l'apprentissage stimulant.",
    "Interactive exercises" : "Des exercices interactifs",
    "Your personal dictionaries" : "Vos dictionnaires personnels",
    "Smart progress tracking" : "Suivi de progression intelligent",
    "Analyze your progress with detailed statistics, identify your strengths and focus on areas for improvement" : "Analysez votre progression avec des statistiques détailées, identifiez vos forces et focalisez-vous sur les zones pour améliorer",
    "Multilingual learning": "Apprentissage multilingue",
    "Learn an unlimited number of languages by creating YOUR own dictionaries" : "Apprendre un nombre illimité de langues par la création de vos propres dictionnaires",
    "Spacing-based revisions (SRS)" : "Révisions basées sur l'espace (SRS)",
    "Benefit from a spaced repetition system to memorize each new word added to your vocabulary" : "Bénéficiez de révisions basées sur l'espace pour mémoriser durablement chaque mot ajouté à votre vocabulaire",
    "Sharing and community" : "Partage et communauté",
    "Share your progress and discover new approaches by interacting with a community of passionate learners" : "Partagez vos progrès et découvrez de nouvelles approches en interagissant avec une communauté d’apprenants passionnés",
    "Join LexiLearn": "Rejoignez LexiLearn",
    "Learn More": "En savoir plus",
    "What is LexiLearn and how does it work?": "Qu'est-ce que LexiLearn et comment cela fonctionne-t-il ?",
    "LexiLearn is a language-learning application designed to help you expand and master your vocabulary in multiple languages You can build personalized vocabulary lists, track your progress with intelligent revision tools, and access interactive quizzes to reinforce your learning": "LexiLearn est une application d'apprentissage des langues conçue pour vous aider à enrichir et à maîtriser votre vocabulaire dans plusieurs langues. Vous pouvez créer des listes de vocabulaire personnalisées, suivre vos progrès grâce à des outils de révision intelligents et accéder à des quiz interactifs pour renforcer votre apprentissage.",
    "Is LexiLearn suitable for beginners": "LexiLearn est-il adapté aux débutants ?",
    "Absolutely! LexiLearn caters to all levels, from beginners to advanced learners You can start with basic vocabulary and progress at your own pace, leveraging features like customizable study plans and contextual examples": "Absolument ! LexiLearn s'adresse à tous les niveaux, des débutants aux apprenants avancés. Vous pouvez commencer par le vocabulaire de base et progresser à votre rythme, en tirant parti de fonctions telles que les plans d'étude personnalisables et les exemples contextuels.",
    "Can I use LexiLearn offline?": "Puis-je utiliser LexiLearn hors ligne ?",
    "No, for the moment you cannot use LexiLearn offline, but we are working on it": "Non, pour le moment, vous ne pouvez pas utiliser LexiLearn hors ligne, mais nous travaillons sur ce sujet"


  },
  "WelcomeHeader" : {
    "Pricing": "Tarifs",
    "About": "A propos",
    "Login": "Se connecter",
    "Logout": "Se déconnecter"
  },
  "Footer": {
    "About us": "A propos de nous",
    "Simply learn by cumulating knowledge": "Apprendre simplement par l'accumulation de connaissances.",
    "Quick Links": "Liens",
    "Home": "Accueil",
    "About": "A propos",
    "Pricing": "Tarifs",
    "Contact": "Contact",
    "Contact us": "Nous contacter",
    "copyright": "2024 LexiLearn. Tout droits réservés."
  },
  "Signin" : {
    "Enter your email": "Entrez votre email",
    "Enter your password": "Entrez votre mot de passe",
    "Sign in": "Se connecter",
    "Email": "Email",
    "Password": "Mot de passe",
    "Sign in with Google": "Se connecter avec Google",
    "Dont have an account?": "Vous n'avez pas de compte?",
    "Sign up": "S'inscrire",
    "Invalid username or password": "Nom d'utilisateur ou mot de passe invalide",
    "An error occurred, Please try again": "Une erreur est survenue, Veuillez réessayer",
    "Network error, Please try again": "Erreur de réseau, Veuillez réessayer"
  },
  "Signup" : {
    "Enter your email": "Entrez votre email",
    "Enter your password": "Entrez votre mot de passe",
    "Sign In": "Se connecter",
    "Email": "Email",
    "Password": "Mot de passe",
    "Sign in with Google": "Se connecter avec Google",
    "Already have an account?": "Déjà membre?",
    "Sign up": "S'inscrire",
    "Sign Up": "S'inscrire",
    "Confirm your password": "Confirmez votre mot de passe",
    "Passwords do not match": "Les mots de passe ne correspondent pas",
    "Username": "Nom d'utilisateur",
    "Enter your username": "Entrez votre nom d'utilisateur",
    "Your username can be used for login and will be used throughout the application": "Votre nom d'utilisateur peut être utilisé pour la connexion et sera utilisé partout dans l'application"
  },
  "GoogleButton": {
    "Continue with Google": "Se connecter avec Google"
  },
  "ModeToggle": {
    "Toggle theme": "Changer le thème",
    "Light": "Clair",
    "Dark": "Sombre",
    "System": "Système"
  },
  "Contact": {
    "Failed to send message, Please try again": "Echec de l'envoi du message. Veuillez réessayer.",
    "Thanks for your message!": "Merci pour votre message!",
    "Contact Us": "Nous contacter",
    "Feel free to contact us":
    "Vous avez des questions ou avez besoin d'aide? que ce soit une demande de fonctionnalité, de support technique ou des questions générales, n'hésitez pas a nous contacter.",
    "Your email": "Votre email",
    "Subject": "Sujet",
    "Let us know how we can help you": "Faites-nous savoir si nous pouvons vous aider",
    "Your message": "Votre message",
    "Leave a comment": "Laissez un commentaire...",
    "Send": "Envoyer"
  },
  "notFound": {
    "404 - Page Not Found": "404 - Page introuvable",
    "Sorry, the page you are looking for does not exist": "Désolé, la page que vous recherchez n'existe pas.",
    "Go back home": "Retourner sur la page d'accueil"
  },
  "LanguageFilter": {
    "Select language": "Sélectionner un language...",
    "Search language": "Rechercher un language...",
    "No language found": "Aucun language trouvé"
  },
  "Dashboard": {
    "Select a language to view dictionary data": "Veuillez sélectionner un language pour afficher le dictionnaire.",
    "No data found for this language": "Aucune donnée pour ce language.",
    "Modify Profile": "Modifier le profil",
    "total words added": "Total de mots ajoutés",
    "words added this month": "Mots ajoutés ce mois-ci",
    "Total dictionaries": "Total de dictionnaires",
    "My dictionaries": "Mes dictionnaires",
    "No dictionary available": "Aucun dictionnaire disponible"
  }
}